{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "activity_regularizer": null, "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "padding": "valid", "activation": "linear", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "conv2d_1", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "filters": 32, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "padding": "valid", "activation": "linear", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "conv2d_2", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "use_bias": true, "padding": "valid", "activation": "linear", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "conv2d_3", "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "linear", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "units": 128}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.5, "seed": null}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activation": "linear", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_2", "units": 3}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}}], "keras_version": "2.1.3"}